// На числовой прямой окрасили N отрезков.
// Известны координаты левого и правого концов каждого отрезка [Li, Ri]. Найти сумму длин частей числовой прямой, окрашенных ровно в один слой.
// N ≤ 10000. Li, Ri — целые числа в диапазоне [0, 109].

// Формат ввода
// В первой строке записано количество отрезков.
// В каждой последующей строке через пробел записаны координаты левого и правого концов отрезка.

// Формат вывода
// Выведите целое число — длину окрашенной в один слой части.


#include <iostream>
#include <cassert>

using namespace std;

int main() {
    
    return 0;
}